{
  "id": "8ccf930b-90a4-430a-bf64-49f61690456546",
  "title": "Информатика 6 класс. Мугалимдер үчүн колдонмо",
  "desc": "окуучуларда информация менен иштөөгө карата жоопкерчиликтүү жана тандоочу мамилени калыптандыруу, таанып-билүү, интеллектуалдык жана чыгармачылык жөндөмдүүлүктөрүн өнүктүрүү",
  "author": {
    "name": "Т.Р. Орускулов, М.У. Касымалиев, А.А. Кузнецов, Л.Л. Босова",
    "email": "Nathanial_Parker15@gmail.com",
    "phone": "961.909.3337 x663",
    "bio": "turf advocate, developer",
    "avatar": "https://cloudflare-ipfs.com/ipfs/Qmd3W5DuhgHirLHGVixi6V76LhCkZUz6pnFt5AJBiyvHye/avatar/1214.jpg"
  },
  "tags": [
    "информатика",
    "6-класс",
    "колдонмо"
  ],
  "date": "2024-05-04T22:47:47.504Z",
  "cover": "/src/data/images/mukaba-informatika-6klass.jpg",
  "pages": "686",
  "chapters": [
    {
      "id": "28afe551-7d9c-40fd-bb7d-a6d0b58de8b7",
      "parent": null,
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "Мазмуну",
      "desc": "",
      "tags": [],
      "date": "2024-05-05T18:45:51.977Z",
      "pages": "1",
      "expanded": false,
      "order": 1,
      "items": 0,
      "blocks": [
        {
          "type": "html",
          "content": "<p>МАЗМУНУ</p><p><br></p><p>1. ТҮШҮНДҮРМӨ КАТ</p><p>2. МАЗМУНДУК БАГЫТТАР. КУРСТУН ЛОГИКАЛЫК ТҮЗҮМҮ.</p><p>2.1. «Информация жана информациялык процесстер» мазмундук багыты</p><p>2.2. «Компьютер» мазмундук багыты</p><p>2.3. «Алгоритм жана программалоо» мазмундук багыты</p><p>2.4. «Информациялык-коммуникациялык технологиялар» мазмундук багыты</p><p><br></p><p>3. БИЛИМ БЕРҮҮ СТАНДАРТЫ БОЮНЧА ПРЕДМЕТТИН МАЗМУНУ&nbsp;</p><p><br></p><p>4. Болжолдуу тематикалык планы</p><p><br></p><p>5. Окуучулардын жетишкендиктерин баалоонун критерийлери</p><p>5.1. Баа коюунун критерийлери</p><p>5.2. Оозеки жоопторду баалоонун критерийлери</p><p>5.3. Практикалык ишти баалоонун критерийлери</p><p>5.4. Тесттерди баалоонун критерийлери</p><p>5.5. Окуучуларды баалоонун критерийлери</p><p>5.6. Ресурсттук камсыздоого коюлган талаптар</p><p><br></p><p>6. САБАКТАР ҮЧҮН МЕТОДИКАЛЫК КОЛДОНМО</p><p>6.1. 1–2-сабактар. Информатика курсун окутуунун максаттары. Жумушчу орунду уюштуруу жана техникалык коопсуздук. Курчап турган дүйнөнүн объектилери.</p><p>6.2. 3–4-сабактар. Компьютердик объекттер. Файлдар жана каталогдор. Файлдын өлчөмү.</p><p>6.3. 5–6-сабактар. Объекттердин жана алардын көптүктөрүнүн катыштарынын ар түрдүүлүгү. Көптүктөр ортосундагы катыштар.</p><p>6.4. 7-сабак. Катыш «курамына кирет»</p><p>6.5. 8–9-сабактар. Объекттин түрлөрү жана алардын классификациясы.</p><p>6.6. 10–11-сабактар. Объекттердин системалары. Системанын курамы жана структурасы.</p><p>6.7. 12–13-сабактар. Объекттердин классификациясы. Персонал компьютер система катарында.</p><p>6.8. 14–15-сабактар. Биздин айланабыздагы информация.</p><p>6.9. 16–17-сабактар. Информацияны сактоо.</p><p>6.10. 18-19-сабак. Информацияны берүү.</p><p>6.11. 20-21-сабак. Информацияны коддоо.</p><p>6.12. 22-23-сабак. Компьютер.</p><p>6.13. 24-25-сабак. Компьютердин эсине информацияны киргизүү.</p><p>6.14. 26-27-сабак. Компьютерди башкаруу.</p><p>6.15. 28-29-сабак. Компьютердик графика. Графикалык редактордун инструменттери.</p><p>6.16. 30-31-сабак. Графикалык сүрөттөлүштөрдү түзүү.&nbsp;</p><p>6.17. 32-сабак. Компьютерде тексттерди даярдоо. Текст информацияны берүү формасы катары. Компьютер – тексттерди даярдоонун негизги инструменти.</p><p>6.18. 33-сабак. Тексттик документтин негизги объекттери. Текстти киргизүү.</p><p><br></p><p>7.&nbsp;ТЕСТТЕРДИН КУРАМЫ(жооптору менен)</p><p>7.1. § 1. Объекты окружающего мира</p><p>7.2. § 2. Компьютерные объекты</p><p>7.3. § 3. Отношения объектов и их множеств</p><p>7.4. § 4. Классификация объектов</p><p>7.5. § 5. Системы объектов</p><p>7.6. § 6. Персональный компьютер как система</p><p>7.7. § 7. Информация вокруг нас</p><p>7.8. § 8. Хранение информации</p><p>7.9. § 9. Передача информации</p><p>7.10. § 10. Кодирование информации</p><p>7.11. § 11. Компьютер</p><p>7.12. § 12. Ввод информации в память компьютера</p><p>7.13. § 13. Управление компьютером</p><p>7.14. § 14. Компьютерная графика</p><p>7.15 § 15. Текстовая информация</p><p>7.15 Тест№1.Текст - форма представления информации</p><p>7.15 Тест №2.&nbsp;Тест. Ввод текста</p><p>7.15 Тест № 3. Редактирование текста</p><p>7.15 Тест №4.Тест. Работа с фрагментами текста</p><p>7.15 Тест №5. Тест. Форматирование текста</p><p>7.15 Тест №6. Тест. Создаем таблицы</p>"
        }
      ]
    },
    {
      "id": "f76a50be-dd32-4898-9c33-78d2ecaf748332",
      "parent": null,
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "Түшүндүрмө кат",
      "desc": "",
      "tags": [],
      "date": "2024-05-05T11:48:59.450Z",
      "pages": "3",
      "expanded": false,
      "order": 2,
      "items": 0,
      "blocks": [
        {
          "type": "html",
          "content": "<p class=\"ql-align-center\"><strong class=\"ql-size-large\">1. ТҮШҮНДҮРМӨ КАТ</strong></p><p><br></p><p>\tАзыркы мезгилде билим берүүнү информациялаштыруунун бирден-бир актуалдуу багыты катары информатикага, информациялык-коммуникациялык технологияга (ИКТ) окутуунун мазмунун жана методикасын ылайыкташтыруу болуп саналат. Билим берүү системасындагы мындай өзгөрүүлөр билим берүүнү массалык коммуникациялоо жана информатизациялоо шартында жүрүп жатат.</p><p><br></p><p class=\"ql-align-center\"><strong>Информатика предметтинин окуу пландагы орду</strong></p><p><br></p><p>\tБазистик окуу планынын мамлекеттик компонентине ылайык, жалпы орто билим берүүнүн негизги жана жогорку баскычтарында Информатика предметине төмөндөгүдөй окуу жүктөмү аныкталган:&nbsp;</p><p>\tНегизги класста (5–6-класстарда) – жумасына 1 саат, окуу жылына 34 саат каралган.</p><p>\tБазалык курс компьютердик техникалар менен жабдылган кабинети бар жалпы билим берүүчү мектептердин V–IX класстарында. Ал эми Х–XI класстарда милдеттүү профилдик курстар түрүндө жогорулатылган жана тереңдетилген деңгээлдерде улантылып, информатика боюнча профессионалдык билим берүүгө даярдоочу курс катары улантылып окутулат.</p><p>\tМектептик компонентке ылайык мектеп-гимназия жана лицейлик компоненттер сакталып, окутуу ийримдер, лекциялар, атайын курстар ж. б. аркылуу ишке ашырылат.&nbsp;&nbsp;</p><p><br></p><p class=\"ql-align-center\"><strong>Информатиканы окутуунун максаты жана милдеттери</strong></p><p><br></p><p>Учурдагы информациялык билим берүү – заманбап мектеп окуучуларынын информациялык маданиятын калыптандыруучу, информациялык жана коммуникациялык технологияларды (ИКТ) колдонуу муктаждыктарын канааттандыруучу негизги шарттардын бири болуп саналат.&nbsp;</p><p>Бүгүнкү күндө ИКТ каражаттары башка предметтерди өздөштүрүүдө да, күнүмдүк турмушта да кеңири колдонулууда. ИКТ каражаттары окуу процессин индивидуалдаштырууга, натыйжалуулугун жогорулатууга шарт түзөт. “Информатика” курсунда окуучулар маалымат технологияларынын теориялык негиздери менен таанышып, ИКТ каражаттарын колдонуунун практикалык билимине, билгичтигине көндүмџнө ээ болушат.&nbsp;</p><p>Информатиканы окуп, аны өздөштүрүү – жалпы билим берүүнүн башкы максаттарына жетишүүгө маанилүү салым кошуу менен бирге, төмөнкү милдеттерди да жүзөгө ашырууга көмөк көрсөтөт:</p><p><br></p><p><strong>5 – 6- класстар</strong></p><p>\t–<em> окуучуларда жалпы билим, билгичтиктерди информатиканын жана ИКТнын методдорунун, каражаттарынын жана ыкмаларынын негизинде өнүктүрүү,</em> тактап айтканда, информациянын ар кандай түрлөрү менен иштөө, өз алдынча иш-аракеттерди пландоо, жекече жана топто маалыматтык ишмердүүлүгүн жүргүзүү, натыйжаларга жетишүү жана аларды баалоо жөндөмдүүлүктөрүн өздөштүрүү;</p><p>\t– <em>окуучуларда информация менен иштөөгө карата жоопкерчиликтүү жана тандоочу мамилени калыптандыруу,</em> таанып-билүү, интеллектуалдык жана чыгармачылык жөндөмдүүлүктөрүн өнүктүрүү.</p><p><br></p><p><strong>Предметтик компетенттүүлүктөр</strong></p><p><br></p><p>\tМектепте Информатика предметин окутууда окуучулар негизги жана предметтик компетенттүүлүктөргө ээ болушат.&nbsp;</p><p>\tКомпетенттүүлүк – (лат. ылайык келүү, шайкештик) – белгилүү бир кырдаалдарда (окуу, инсандык, кесиптик иште) окуучунун билимдерди, ыкмаларды, жөндөмдүүлүктөрдү жана алардын ар кандай элементтерин өз алдынча колдоно алуучу өзүнүн көп кырдуу жөндөмү.</p><p>\tНегизги компетенттүүлүктөр конкреттүү предметтин мазмунунда калыптанып, ишке ашырылган жана окуучунун социалдык тажрыйбасына негизделген билимдин натыйжалары болуп эсептелет. Негизги компетенттүүлүктөр көп функциялуулулугу менен айырмаланат.</p><p>\tНегизги компетенттүүлүктөрдүн топтомун аныктоо үчүн критерий катары ресурстардын негизги категориялары кабыл алынган, аларды адамдар азыркы дүйнөдө ийгиликтүү жана атаандаштыкка жарамдуу болуу үчүн инсандык жана кесиптик чөйрөлөрдө колдонушат:</p><p>маалыматтык ресурстар;</p><p>ресурс катары башка адамдар жана адамдардын топтору;</p><p>ресурс катары адам өзү.</p><p>\tУшуга байланыштуу негизгилер катары төмөнкү үч компетенттүүлүк каралат:</p><p>\t<strong><em>1) маалыматтык компетенттүүлү</em></strong><em>к</em> – өз ишмердүүлүгүн пландаштыруу жана ишке ашыруу, аргументтүү тыянактарды чыгаруу үчүн маалыматты пайдаланууга болгон даярдык. Маалымат менен иштей билүү төмөнкүлөрдү: жетпеген маалыматты максаттуу издөөнү, айрым фрагменттерди салыштырууну; бүтүн алып анализдөө көндүмдөрүнө ээ болууну; божомолдорду (гипотезаларды) коё билүүнү карайт. Адамга сынчыл ой жүгүртүүгө негизделген маалыматтын негизинде ойлонулган чечимдерди кабыл алууга мүмкүндүк берет.</p><p>\t<strong><em>2) социалдык-коммуникативдик компетенттүүлүк </em></strong>– өз умтулууларын башка адамдардын жана социалдык топтордун кызыкчылыктары менен шайкеш келтирүү, позициялардын ар түрдүүлүгүн таануунун жана башка адамдардын баалуулуктарына (диний, этникалык, кесиптик, инсандык ж.б.) сыйлуу мамиленин негизинде өз көз карашын цивилизациялуу коргоого болгон даярдык. Диалогдо керектүү маалыматты алуу жана инсандык, социалдык жана кесиптик проблемаларды чечүү үчүн аны оозеки жана жазуу жүзүндө туюнта билүү зарылдыгы. Милдеттерди чечүү үчүн башка адамдардын жана социалдык институттардын ресурстарын пайдаланууга мүмкүндүк берет.&nbsp;</p><p>\t<strong><em>3) өзүн-өзү уюштуруу жана маселелерди чечүү компетенттүүлүгү</em></strong> – маалыматта, окуудагы жана турмуштук кырдаалдардагы карама-каршылыктарды табууга жана ар түрдүү ыкмаларды өз алдынча жана башка адамдар менен өз ара биргелешип&nbsp;колдонууга, ошондой эле андан аркы аракеттер тууралуу чечимдерди кабыл алууга&nbsp;болгон даярдык.</p><p>Компетенттүүлүктөрдүн калыптануу деңгээлдерин аныктоо үчүн негиз болуп окуучунун өз алдынчалыгынын деңгээли жана маселени чечүүдө ишмердүүлүктүн пайдаланылган түрлөрүнүн татаалдыгы эсептелет. Компетенттүүлүктүн ар бир түрү бир катар аспектилерди камтыйт. Ар бир аспект үчүн калыптануунун үч деңгээли белгиленген.</p><p>\t<strong>Биринчи деңгээл (репродуктивдүү)</strong> окуучулардын үлгү боюнча (аткаруунун берилген алгоритмин) аткара билүүсү менен мүнөздөлөт.</p><p>\t<strong>Экинчи деңгээл (продуктивдүү)</strong> окуучулар жөнөкөй ишмердикти аткаруу, ал ишмердиктин өздөштүрүлгөн алгоритмин башка кырдаалда колдонуу жөндөмдүүлүгү менен мүнөздөлөт.</p><p>\t<strong>Үчүнчү деңгээл (креативдүү)</strong> окуучулардын өз алдынча конструкциялоонун элементтери жана аны негиздөө менен коштолгон татаал составдуу&nbsp;ишмердикти аткарууну билдирет.</p><p>\tКомпетенттүүлүктүн белгиленген деңгээлдери окутуу баскычтары менен түздөн-түз салыштырылган эмес. Окутуунун ар бир деңгээлинде окуучунун курактык жана жеке өзгөчөлүктөрүнө ылайык жана билим берүү шарттарын эсепке алуу менен бардык деңгээлдердеги компетенттүүлүктөргө ээ болушу күтүлөт.&nbsp;</p><p>\tМындай мамиле ар бир окуучунун жакынкы өнүгүү зонасын эсепке алууну жана билим берүү жыйынтыктарына жетишүүнү камсыз кылат.</p><p><br></p><p class=\"ql-align-center\"><strong>Информатиканы окутуунун өзгөчөлүктөрү</strong></p><p><br></p><p>\tМектепте Информатика сабагын окуунун негизги предметтик натыйжалары <em>«Информация жана информациялык процесстер», «Компьютер», «Алгоритм жана программалоо», «Информация жана коммуникациялык технологиялар»</em> аттуу <strong>мазмундук багыттарда</strong> чагылдырылган:</p><ul><li>маалыматтык жана алгоритмдик маданиятты калыптандыруу;&nbsp;</li><li>компьютерди маалыматтарды иштетүүчү универсалдуу каражат катары кабылдоо; компьютердик жабдууларды колдонуунун негизги билгичтиктерин жана көндүмдөрүн өнүктүрүү;</li><li>«информация», «алгоритм», «модель», «программа» сыяктуу негизги түшүнүктөрүн, алардын маанисин, касиеттерин түшүндүрүү;</li><li>учурдагы коомдун кесиптик ишмердүүлүк үчүн абдан зарыл болгон алгоритмикалык ой жүгүртүүнү өнүктүрүү; конкреттүү аткаруучу үчүн алгоритм түзүү жана жаздыруу боюнча билгичтиктерин өнүктүрүү; алогоритмикалык конструкциялар, логикалык маани жана операциялар тууралуу билимин калытандыруу; программалоо тилдеринин бири жана тармактуу, шарттуу, циклдүү деп аталган негизги алгоритмикалык түзүлүштөр менен тааныш болуу;</li><li>маалыматты формалдаштыруу, структуралаштыруу билгичтиктерин калыптандыруу, алдыга коюлган маселеге таблица, схема, график, диаграмма менен иштөөгө ылайык, маалыматтарды иштетүү боюнча тийиштүү программалык каражаттарды колдонуу, база менен иштөө ыкмасын тандоону билүү;</li><li>компьютердик программалар жана Интернет менен иштөө учурунда коопсуз жана максатка ылайык иш-аракет аткаруу билгичтиктери менен көндүмдөрүн, ошондой эле маалыматтык этика жана укуктук нормаларын сактоо билгичтиктерин калыптандыруу.</li></ul><p>Мындай мазмундук багыттар аркылуу окуучулардын предметтик жана метапредметтик компетенциялары калыптандырылууга тийиш.&nbsp;</p><p><br></p><p>\t<strong>Предметтик компетенттүүлүктөргө</strong> окуучулар тарабынан предметти окуп-үйрөнүү учурунда өздөштүрүлгөн,&nbsp;предметтик тармакка тийиштүү билимдер жана жөндөмдүүлүктөр, окуу предметинин чегинде жаңы билимдерди өздөштүрүүгө, окуу, окуу-долбоордук, социалдык-долбоордук абалдарда кайрадан түзүү жана колдонууга багытталган ишмердүүлүктүн түрлөрү,&nbsp;илимий ой жүгүртүү жөндөмдүүлүктөрү, негизги теориялар, мамиленин типтери жана түрлөрү боюнча илимий түшүнүккө ээ болуу, илимий терминологияны өздөштүрүү, негизги түшүнүктөргө ээ болуу, методдорду жана ыкмаларды үйрөнүү сыяктуу иш-аракеттер кирет.&nbsp;Мындай иш аракеттер төмөнкүдөй предметтик компетенттүүлүктөрдүн аныкталышына негиз боло алат:</p><p>Маалыматтык сабаттуулук, маалыматтарды издөө, кабыл алуу, аралыкка берүү ыкмаларына ээ болуу. Мында маалыматтар ар түрдүү болушу мүмкүн: текст, таблица, диаграмма жана алардын жыйындысы;</p><p>Логикалык жана алгоритмдик компетенттүүлүк, логикалык жана алгоритмдик ой-жүгүртүүнүн негиздерин билүү, жөнөкөй алгоритмдерди түзүү жана алгоритм аркылуу иш жүргүзө алуу;</p><p>ИКТ-квалификациясынын негиздери, маалыматтык маселелерди чечүүдө компьютерди колдонуунун негиздерин жана ИКТнын башка каражаттарын колдоно билүү;</p><p>Моделдөө жана дизайн. Өнөр жай буюмдарына болгон техникалык эстетиканын талаптары жөнүндө, дизайндын түстөрүнүн берилиштери, көркөм конструкциялоодо түстөрдү колдонуунун негизги принциптери&nbsp;боюнча түшүнүктөргө ээ болуу. Объекттердин информациялык моделдерин түзүп колдонгонду билүү. Иштеп жаткан учурда маалым системалары менен иштөөнү жана маалыматтар базасынын моделдерин түзө билүү. Өздүк информациялык моделдерди түзө билүү: достордун телефондорунун базалары, кийимдин, мебелдердин, информациялык процесстин.</p><p>Коммуникациялык компетентүүлүк маалыматтарды аралыкка берүүгө жана алууга байланышкан маалыматтарды алмашуу компетентүүлүктөрүнүн активдүү жагдайы менен байланыштуу.&nbsp;</p><p><br></p><p>Метапредметтик компетенциялар:</p><p>Жалпы маданияттык. Мында окуучунун таанып билүү ишмердүүлүгү боюнча жалып маселелер каралат.</p><p>Социалдык. Окуучунун билиминин жана тажрыйбасынын жарандык-коомдук ишмердүүлүктөрдө пайдаланылышын кароочу компетенция. Окуучу жашоого зарыл болгон социалдык активдүүлүк көндүмдөрдү жана функционалдык сабаттуулуктарды пайдаланат.&nbsp;</p><p>Информациялык. Реалдуу объекттердин (телевизор, магнитофон, телефон, компьютер, принтер ж. б.) жана информациялык технологиялардын (аудио жана видео жазуу, электрондук почта, ММК, Интернет ж. б.) жардамы менен окуучунун маалыматтарды издөө, анализдөө, керектүүсүн тандап алуу, сактоо жана аларды жөнөтүү көндүмдөрү калыптандырылат. Бул компетенция окуу предметтерде, билим берүүнүн башка&nbsp;тармактарында, ошондой эле коомдук чөйрөдө окуучунун маалымат менен иштөө көндүмдөрүнүн калыптанышына жардам берет.&nbsp;</p><p>Коммуникативдик компетенция окуучунун өзүнџн тегерегиндеги адамдар, ар түрдүү топтор менен мамиле жасай билүү көндүмдөрүн калыптандырат. Мында коллектив менен иштей билүү, кат алмашуу, анкетага жооп берџџ, арыз жаза билүү, суроо бере билүү, талкууга катышуу ж.у.с. жөндөмдөр эске алынат.</p><p>Маани-маңыздык. Окуучунун дүйнө таанымы, чөйрөгө ыкташуусу, өзүнүн коомдук турмуштагы ордун аңдап билиши, маанилүү чечим кабыл алышы ж. б. билгичтиктер каралат.&nbsp;&nbsp;</p><p>Окуу-таанып билүү. Бул реалдуу бир объектти таанып билүүдө окуучунун өз алдынча окуу, үйрөнүү, аракеттенүү жана өзүн-өзү баалоо ишмерлүүлүгүн кароочу компетенция. Мында белгилүү бир билимге ээ болуу үчүн окуучу ар түрдүү ыкмаларды жана методдорду колдонот.&nbsp;</p><p>Жеке инсандык. Бул ар бир инсандын ички дүйнөсүн, жекече психологиялык сапатын, өзүнө жана башкаларга болгон мамилесин, мүмкүнчүлүктөрүн, жөндөмүн, баалуулуктарын, алдыга койгон максаттарын, идеяларын ж.у.с. билимдерин кароочу компетенция.&nbsp;&nbsp;</p><p><br></p>"
        }
      ]
    },
    {
      "id": "c8ff8037-3cd1-4d89-9025-6e1a4ccedbf9",
      "parent": null,
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "6. САБАКТАР ҮЧҮН МЕТОДИКАЛЫК КОЛДОНМО",
      "desc": "",
      "tags": [],
      "date": "2024-05-04T21:26:56.136Z",
      "pages": "1",
      "expanded": false,
      "order": 3,
      "items": 4,
      "blocks": [
        {
          "type": "html",
          "content": "<p><strong class=\"ql-size-large\">6. САБАКТАР ҮЧҮН МЕТОДИКАЛЫК КОЛДОНМО</strong></p><p><strong>6.1. 1-сабак. Информатика курсун окутуунун максаттары. Жумушчу орунду уюштуруу жана техникалык коопсуздук. Компьютердин негизги компоненттери;</strong></p><p><strong><span class=\"ql-cursor\">﻿</span>6.2. 2-сабак. Персонал компьютер;</strong></p><p><strong>6.3. 3-сабак. Персоналдык компьютердин программалык жабдылышы. Системалык программалык жабдылыш;</strong></p><p><strong>6.4. 4-сабак. Колдонмо программалык камсыздоо;</strong></p><p><strong>6.5. 5-сабак. Алгоритмдештирүүнүн негиздери. Турмуштук маселелер. Алгоритм деген эмне?</strong></p><p><strong>6.6. 6-сабак. Алгоритмдер жана аткаруучулар. Аткаруучулардын ар түрдүүлүгү. Формалдык аткаруучу жана автоматташытруу;</strong></p><p><strong>6.7. 7-сабак. Алгоритмдин жазылыш формалары;</strong></p><p><strong>6.8. 8-сабак. Сызыктуу алгоритмдер;</strong></p><p><strong>6.9. 9-сабак. Тармактуу алгоритмдер;</strong></p><p><strong>6.10. 10-1-сабак. Аткаруучу ГРАТ (Чертежник). Алгоритмдик башкаруунун мисалы ГРАТ (Чертежник);</strong></p><p><strong>6.11. 10-2-сабак. Жардамчы алгоритмдерди колдонуу;</strong></p><p><strong>6.12. 10-3-сабак. ГРИС (Чертежник) аткаруучу үчүн кайталануучу алгоритмдер;</strong></p><p><strong>6.13. 10-4-сабак. «Алгоритм» темасы боюнча үйрөнгөн окуу материалдарын жалпылоо жана систематизациялоо;</strong></p><p><strong>6.14. 11-сабак. Моделдөө таанып билүүнүн методу катары;</strong></p><p><strong>6.15. 12-сабак. Белги менен туюнтулган информациялык моделдер. Сөз менен, илимий жана көркөм сыпаттоолор;</strong></p><p><strong>6.16. 13-сабак. Математикалык моделдер;</strong></p><p><strong>6.17. 14-сабак. Таблицалык информациялык моделдер. Таблицаны түзүүнүн эрежелери;</strong></p><p><strong>6.18. 15-сабак. Эсептөөчү таблицалар. Таблицалардын жардамы менен логикалык маселелерди чыгаруу;</strong></p><p><strong>6.19. 16-сабак. Графиктер жана диаграмммалар. Чоңдуктардын жана алардын катыштарынын өзгөрүү процесстерин көрүнүктүү көрсөтүү;</strong></p><p><strong>6.20. 17-сабак. Информациялык моделдерди түзүү. Диаграммалар;</strong></p><p><strong>6.21. 18-сабак. Схемалардын көп түрдүүлүгү жана алардын колдонулуш чөйрөлөрү;</strong></p><p><strong>6.22. 19-27-сабактар. Мугалимдрдин эсине!</strong></p><p><strong>6.23. 28-сабак. Мультимедиа технологиясы;</strong></p><p><strong>6.24. 29-сабак. Компьютердик презентациялар;</strong></p><p><strong>6.25. 30-сабак. Мультимедиалык презентацияларды түзүү (иштеп чыгуу);</strong></p><p><strong>6.26. 31-сабак. «Мультимедиа» главасынын негизги түшүнүктөрүн жалпылоо жана системалаштыруу;</strong></p><p><br></p>"
        }
      ]
    },
    {
      "id": "0fad8982-85c5-459a-b900-5787639e6cb9",
      "parent": "c8ff8037-3cd1-4d89-9025-6e1a4ccedbf9",
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "6.3. 3-сабак. Персоналдык компьютердин программалык жабдылышы. Системалык программалык жабдылыш",
      "desc": "",
      "tags": [],
      "date": "2024-05-05T20:25:13.160Z",
      "pages": "1",
      "expanded": false,
      "order": 0,
      "items": 0,
      "blocks": [
        {
          "type": "html",
          "content": "<p><strong>6.3. 3-сабак. Персоналдык компьютердин программалык жабдылышы. Системалык программалык жабдылыш</strong></p><p><br></p><p>\tТемага ылайык пландалуучу билим берүүнүн жыйынтыктары:</p><p>\t<em>предметтик </em>– персоналдык компьютердин программалык жабдылышы жана анын негизги группалары түшүнүктөрү;</p><p>\t<em>метапредметтик </em>– персоналдык компьютердин системалык программалык жабдылышынын аткарган кызматтарын түшүнүү;</p><p>\t<em>жеке инсандык </em>– азыркы учурдагы адам баласынын жашоосундагы компьютердин ролун түшүнүү; информациялык коопсуздуктун маанилүү багыты катарында вирустан коргонуунун маанисин түшүнүү.</p><p>\t</p><p>Чечилүүчү окуу тапшырмалары:</p><p>1) персоналдык компьютердин программалык жабдылышы жөнүндөгү окуучулардын түшүнүктөрүн жалпылап кеңейтүү;</p><p>2) системалык программалык жабдылыштардын түрдүү категориялары жөнүндөгү түшүнүктөрдү систематизациялоо;</p><p>3) операциялык системаларды жана алардын аткарган функцияларын кароо.</p><p><br></p><p>Сабакта карала турган негизги түшүнүктөр: программа; программалык жабдуулар (ПЖ); системалык ПЖ; операциялык система; архиватор; антивирустук программа.</p><p>Сабакта колдонулуучу ИКТ каражаттары:</p><p>мугалимдин персоналдык компьютери (ПК), мультимедиялык компьютер, экран;</p><p>окуучулардын персоналдык компьютерлери;</p><p>Сабактын темасындагы мазмунду берүүнүн өзгөчөлүктөрү.</p><p>Сабактын башталышында төмөндөгүлөр аткарылат:</p><p>1) §1.2 суроолору боюнча өтүлгөн материалдарды кайталоо;</p><p>2) үйгө берилген тапшырмаларды (практикалык тапшырмалардан) көз жүгүртүп текшерүү;</p><p>3) Толуктоо иретиндеги берилген тапшырмаларды текшерүү.</p><p>Сабактагы жаңы материалды кароону КТдагы №9 тапшырманы бирге аткаруу аркылуу баштаса болот. Сабактын материалын «Компьютердин программалык жабдылышы» презентациясын колдонуу менен берсе болот (Электрондук тиркемеден алып). Толуктоо максатында «Персоналдык компьютердин программалык жабдылышынын структурасы», «Системалык программалык жабдылыш», «Операциялык система» презентацияларын колдонсо болот.</p><p>Өзгөчө көңүлдү антивирустук коргонууга буруу менен билим берүү мекемесинде кандай антивирустук программалар колдонулса алар менен иштөөнүн ыкмаларын карап чыгып үйрөтүү зарыл.</p><p>Сабактын практикалык бөлүгүндө кандай кандай антивирустук программа мектепте колдонулса ошол программа менен иштөөнүн төмөндөгү планын колдонуу сунуш кылынат:</p><p>1) антивирустук программаны жүктөө;</p><p>2) программа жүктөлгөндөн кийин негизги мүмкүнчүлүктөрү менен таанышуу;</p><p>3) антивирустун базасын жаңылоо функциясын ишке чегүү;</p><p>4) локалдык дискти, флешканы же тандалып алынган папканы сканерлөө жумуштарын аткаруу.</p><p><strong>Үй тапшырмасы</strong>. §2 (1) параграфындагы 1-11 суроолорду жана тапшырмаларды аткаруу.&nbsp;</p><p>Толуктоо иретинде Кошумча тапшырмалардан (КТ) берилген маселелерди иштөө №13-№21.&nbsp;</p><p>Тапшырмалардын жооптору:</p><p><em>21. «Компьютер информацияны иштеп чыгууда универсалдуу каражат катары» кроссвордун жандырып жазууну үй тапшырмасына жана кийин толук аткарылбай калса кайталоо учурнда талкууга алып толтуруп жазууну аягына чейин чыгаруу керек.</em></p><p><br></p>"
        }
      ]
    },
    {
      "id": "0fad8982-85c5-459a-b900-5787899e6cb9",
      "parent": "c8ff8037-3cd1-4d89-9025-6e1a4ccedbf9",
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "6.3. 4-сабак. Алгоритмдердин түрлөрү",
      "desc": "",
      "tags": [],
      "date": "2024-05-05T20:25:13.160Z",
      "pages": "1",
      "expanded": false,
      "order": 0,
      "items": 0,
      "blocks": [
        {
          "type": "html",
          "content": "<p style='font-size:24px;font-weight:bold'>6.4.2 Алгоритмдердин түрлөрү</p>"
        },
        {
          "type": "image",
          "content": [
            {
              "title": "Составление алгоритма заключается в логическом описании процесса решения задачи и требует знания элементов математической логики.",
              "alt": "",
              "src": "/src/data/images/alg1.png",
              "thumb": "/src/data/images/alg1.png"
            }
          ]
        },
        {
          "type": "image",
          "content": [
            {
              "title": "Линейным называется алгоритм, в котором команды выполняются последовательно друг за другом\n//Источник: https://infouch.ru/lineynye-algoritmy-na-yazyke-programmirovaniya-paskal.",
              "alt": "",
              "src": "/src/data/images/alg2.png",
              "thumb": "/src/data/images/alg2.png"
            },
            {
              "title": "Линейным называется алгоритм, в котором команды выполняются последовательно друг за другом\n//Источник: https://infouch.ru/lineynye-algoritmy-na-yazyke-programmirovaniya-paskal.",
              "alt": "",
              "src": "/src/data/images/alg3.png",
              "thumb": "/src/data/images/alg3.png"
            },
            {
              "title": "Линейным называется алгоритм, в котором команды выполняются последовательно друг за другом\n//Источник: https://infouch.ru/lineynye-algoritmy-na-yazyke-programmirovaniya-paskal.",
              "alt": "",
              "src": "/src/data/images/alg4.jpg",
              "thumb": "/src/data/images/alg4.jpg"
            },
            {
              "title": "Линейным называется алгоритм, в котором команды выполняются последовательно друг за другом\n//Источник: https://infouch.ru/lineynye-algoritmy-na-yazyke-programmirovaniya-paskal.",
              "alt": "",
              "src": "/src/data/images/alg5.jpg",
              "thumb": "/src/data/images/alg5.jpg"
            }
          ]
        },
        {
          "type": "video",
          "content": {
            "title": "6.3.3 Системы программирования. Прикладное программное обеспечение",
            "alt": "",
            "src": "/src/data/videos/1.mp4"
          }
        }
      ]
    },
    {
      "id": "776573bb-61a4-4fed-9128-612543b45288",
      "parent": null,
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "7.3 ТЕСТТЕРДИН КУРАМЫ",
      "desc": "",
      "tags": [],
      "date": "2024-05-05T14:29:47.492Z",
      "pages": "1",
      "expanded": false,
      "order": 4,
      "items": 1,
      "blocks": [
        {
          "type": "html",
          "content": "<p><strong class=\"ql-size-huge\">7.&nbsp;ТЕСТТЕРДИН КУРАМЫ</strong></p><p><strong>7.1. § 1. Компьютердин негизги компоненттери жана алардын аткарган негизги кызматтары&nbsp;</strong></p><p><strong>7.2. § 2. Компьютердин программалык жабдылышы</strong></p><p><strong>7.3. § 3. Алгоритм</strong></p><p><strong>7.4. § 4. Алгоритмдер жана аткаруучулар</strong></p><p><strong>7.5. § 5. Алгоритмдердин жазылыш формалары</strong></p><p><strong>7.6. § 6. Сызыктуу алгоритмдер</strong></p><p><strong>7.7. § 7. Аткарууну башкаруу</strong></p><p><strong>7.8. § 8. Моделдөө таанып-билүүнүн методу катары</strong></p><p><strong>7.9. § 9. Белги менен туюнтулган информациялык моделдер. Оозеки, илимий жана көркөм сыпаттоолор</strong></p><p><strong>7.10. § 10. Информациялык моделдерди берүү формалары. Графиктер жана диаграммалар</strong></p><p><strong>7.11. § 11. Тексттик документтер жана аларды түзүүнүн технологиялары</strong></p><p><strong>7.12. § 12. Компьютерде тексттик документтерди түзүү</strong></p><p><strong>7.13. § 13. Текстти форматтоо</strong></p><p><strong>7.14. § 14. Тексттик документтерде информацияларды визуалдаштыруу</strong></p><p><strong>7.15 § 15. Компьютердик сөздүктөр жана котормочу-программалар</strong></p><p><strong>7.16 § 16. Мультимедиа технологиясы</strong></p><p><strong>7.17 § 17. Компьютердик презентациялар</strong></p>"
        }
      ]
    },
    {
      "id": "776573bb-61a4-4fed-9128-612543b45232328",
      "parent": "776573bb-61a4-4fed-9128-612543b45288",
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "7.3. § 3. Алгоритм",
      "desc": "",
      "tags": [],
      "date": "2024-05-05T14:29:47.492Z",
      "pages": "1",
      "expanded": false,
      "order": 0,
      "items": 0,
      "blocks": [
        {
          "type": "html",
          "content": "<p><strong>7.3. § 3. Алгоритм</strong></p><p><br></p><p><strong>1- Тапшырма</strong></p><p>Суроо:</p><p>Берилген 3 сандын эң чоңун табууда кандай алгоритм колдонулат?</p><p><br></p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) тармактуу.</p><p>2) сызыктуу.</p><p>3) циклдуу.</p><p>4) билбейм.</p><p><br></p><p><strong>2- Тапшырма</strong></p><p>Суроо:</p><p>Тармактуу алгоритмде …</p><p><br></p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) аракеттер удаалаш аткарылат.</p><p>2) аракеттердин аткарылышында кандайдыр бир шарт орун алат.</p><p>3) бир эле аракет бир нече жолу кайталанат.</p><p>4) билбейм.</p><p><br></p><p><strong>3- Тапшырма</strong></p><p>Суроо:</p><p>Алгоритм бул, ……</p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) маселе чечүү.</p><p>2) көздөгөн максатка жетиш үчүн аткарылган аракеттердин удаалаш, так ирээти менен аткарылышы.</p><p>3) чоңдуктар менен иштөө.</p><p>4) программа түзүү.</p><p><br></p><p><strong>4- Тапшырма</strong></p><p>Суроо:</p><p>Информатика предмети эмнени үйрөтөт ?</p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) компьютерде маалыматтарды иштегенди.</p><p>2) компьютерде окуганды.</p><p>3) компьютерде эсептегенди.</p><p>4) маалыматтарды чогултканды.</p><p><br></p><p><strong>5- Тапшырма</strong></p><p>Суроо:</p><p>Программа деген эмне?</p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) алгоритм түзүү.</p><p>2) маселени чыгаруунун эрежелери.</p><p>3) компьютер түшүнгөн тилде алгоритм жазуу.</p><p>4) процессор менен эстин кезектешип иштеши.</p><p><br></p><p><strong>6- Тапшырма</strong></p><p>Суроо:</p><p>Тармактуу алгортмдин толук эмес формасында кайсы кызматчы сөз колдонулбайт?</p><p><br></p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) анда.</p><p>2) башы, аягы.</p><p>3) антпесе.</p><p>4) цб ца.</p><p><br></p><p><strong>7- Тапшырма</strong></p><p>Суроо:</p><p>Тармактуу алгортмдин толук эмес формасында кайсы кызматчы сөз колдонулат?&nbsp;</p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) анда.</p><p>2) башы, аягы.</p><p>3) антпесе.</p><p>4) цб ца.</p><p><br></p><p><strong>8- Тапшырма</strong></p><p>Суроо:</p><p>Циклдуу алгортим деген эмне?</p><p><br></p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) «цикл» деген сөздү экранга чыгаруу үчүн түзүлгөн алгоритм.</p><p>2) аракеттери берилген шартка жараша белгилүү кадам менен кайталанган алгоритм.</p><p>3) аракеттери биринин артынан бири табигый түрдө аткарылган алгоритм.</p><p>4) берилген айлананы экранга чыгаруу үчүн түзүлгөн алгоритм</p><p><br></p><p><strong>9- Тапшырма</strong></p><p>Суроо:</p><p>Алгоритмдеги командалар биринин артынан экинчиси удаалаш аткарылса кайсы алгоритм?</p><p><br></p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) сызыктуу.</p><p>2) тармактуу.</p><p>3) циклдуу.</p><p>4) шартсыз.</p><p><br></p><p><strong>10- Тапшырма</strong></p><p>Суроо:</p><p>Х тин 1 ден 10 го чейинки 1 кадамы менен өзгөргөн маанилеринде Y=2х+7 функциясынын маанилерин табу үчүн алгоритм түзүү керек?</p><p><br></p><p>4 вариант жооптон бирөөнү тандап алгыла:</p><p>1) тармактуу.</p><p>2) сызыктуу.</p><p>3) циклдуу.</p><p>4) сызыктуу жана тармактуу.</p><p><br></p><p><strong>Жооптору:</strong></p><p>1) (1 б.) Туура жооптору: 1;&nbsp;&nbsp;</p><p>2) (1 б.) Туура жооптору: 2;&nbsp;</p><p>3) (1 б.) Туура жооптору: 2;</p><p>4) (1 б.) Туура жооптору: 1;</p><p>5) (1 б.) Туура жооптору: 3;</p><p>6) (1 б.) Туура жооптору: 3;&nbsp;</p><p>7) (1 б.) Туура жооптору: 1;</p><p>8) (1 б.) Туура жооптору: 2;</p><p>9) (1 б.) Туура жооптору: 1;</p><p>10) (1 б.) Туура жооптору: 3;</p><p><br></p><p><br></p>"
        }
      ]
    },
    {
      "id": "776573bb-61a4-4fed-9128-612sd23232328",
      "parent": "776573bb-61a4-4fed-9128-612543b45288",
      "book_id": "8ccf930b-90a4-430a-bf64-49f61690456546",
      "title": "7.3. § 4. Сынак",
      "desc": "",
      "tags": [],
      "date": "2024-05-05T14:29:47.492Z",
      "pages": "1",
      "expanded": false,
      "order": 1,
      "items": 0,
      "blocks": [
        {
          "type": "html",
          "content": "<p>Сынакты баштоо үчүн шилтемени басыңыз</p><p><br></p><p><strong><i><a href=\"https://test.ulut.kg/survey/3/survey\" rel=\"noopener noreferrer\" target=\"_blank\">сынак шилтемеси</a></i></strong></p>"
        }
      ]
    }
  ]
}
