export default [
    {
        id: '005503f9-d3ea-4f76-b7a3-5f8b49f73880',
        title: 'Акыл эмгегинин маданияты',
        description: '',
        chapters: [],
    },
    {
        id: 'a4e08aee-1d2c-410b-92e9-66395d4cb05b',
        title: 'Алыкул Осмоновдун тандалган чыгармалары',
        description: '',
        chapters: [
            {
                key: 'a4e08aee-1d2c-410b-92e9-66395d4345435',
                label: 'Кириш сөз',
                content: 'Биздин элибиз ар дайым билимге умтулган адамдарга аяр мамиле жасаган. ' +
                    'Аяр мамиле кылуу дегендин өзү- адамды аздектөө, сыйлоо, аëо жана сүйүү болуп ' +
                    'саналат.   Демек, өз ишин сүйгөн мугалим гана балдарга аяр мамиле кылып, ' +
                    'мээримин төгөт дегенди билдирет.\n' +
                    '\n' +
                    '     Адамзат кылымдар бою мезгилдин кыймылдаткыч күчү болгон сүйүү менен гана' +
                    ' ажайып  нерселерге умтулуп келген. Жаратмандыктын дагы негизин сүйүү түзөт. ' +
                    'Анткени сүйүү бар жерде гана гумандуу педагогика жашайт.',
                children: [
                    {
                        key: 'a4e08aee-1d2c-410b-92e9-66395d2349023125',
                        label: 'Кириш сөз 1',
                        content: 'Окуучунун ишенимине ээ болгон мугалим гана максатына жете алат. ' +
                            'Ар бир аракетине берилгендик менен мамиле кылуу менен ал мыкты инсанды ' +
                            'коомго тарбиялап берет. Эң алды менен мугалим педжамаатка да, ' +
                            'окуучуларга да сый мамиледе, сабырдуу болуусу парз. ' +
                            'Азыркы замандын мугалими кесипкөй  эле эмес, чыныгы адам болууга тийиш. ' +
                            'Ошондо гумандуу педагогика камсыз кылынып, келечек муунга жеткиликтүү ' +
                            'билим , татыктуу тарбия бере алат. '
                    },
                    {
                        key: 'a4e08aee-1d2c-410b-92e9-66395d24564564125',
                        label: 'Кириш сөз 2',
                        content: 'Окуучунун ишенимине ээ болгон мугалим гана максатына жете алат. ' +
                            'Ар бир аракетине берилгендик менен мамиле кылуу менен ал мыкты инсанды ' +
                            'коомго тарбиялап берет. Эң алды менен мугалим педжамаатка да, ' +
                            'окуучуларга да сый мамиледе, сабырдуу болуусу парз. ' +
                            'Азыркы замандын мугалими кесипкөй  эле эмес, чыныгы адам болууга тийиш. ' +
                            'Ошондо гумандуу педагогика камсыз кылынып, келечек муунга жеткиликтүү ' +
                            'билим , татыктуу тарбия бере алат. '
                    },
                ],
            },
        ],
    },
    {
        id: '1c9d41f8-2a3b-4744-9168-ac17ad2bdb4f',
        title: 'Англис тилин оңой үйрөнөбүз',
        description: '',
        chapters: [],
    },
    {
        id: '1196ffc9-7465-453e-a87f-7a805caf420f',
        title: 'Балдар энциклопедиясы',
        description: '',
        chapters: [],
    },
    {
        id: 'dbe68d04-adb2-4909-ae2d-e610a1770185',
        title: 'ГЕОГРАФИЯ. Терминдер, жергиликтүү географиялык түшүнүктөр',
        description: '',
        chapters: [],
    },
    {
        id: '17bae927-f190-4079-969e-276665340857',
        title: 'Кыргыз тилинин орфографиялык сөздүгү',
        description: '',
        chapters: [],
    },
    {
        id: 'dbc5053d-8fc8-4b21-b80c-99add619ccf2',
        title: 'Кыргыз эл жаңылмачтары',
        description: '',
        chapters: [],
    },
    {
        id: 'd7ea5dd2-8404-4077-9b8c-f35a6d145725',
        title: 'Саманчынын жолу',
        description: '',
        chapters: [],
    },
    {
        id: 'a552d96f-5ce2-4bb8-992f-b8763030d265',
        title: 'Энесай кыргыздары',
        description: '',
        chapters: [],
    },
    {
        id: 'dffe0708-243c-4c4b-b1e5-935dc7e16e44',
        title: 'Акыл кенчи',
        description: '',
        chapters: [],
    },
    {
        id: '532fa047-8334-4b87-a363-546458381a81',
        title: 'Ала-Тоо аңгемелери, поэмалары',
        description: '',
        chapters: [],
    },
    {
        id: '56d6fb79-841e-4fff-aa6b-b42d822b9923',
        title: 'Кожомкул балбан баяны',
        description: '',
        chapters: [],
    },
    {
        id: '382ba8aa-97df-4ed0-961b-b1c830d08ef7',
        title: 'Агындылар -1-2 китептер',
        description: '',
        chapters: [],
    },
    {
        id: '4cb158c3-3f94-4b5b-8e59-7d2b7d072683',
        title: 'Адашкан көч',
        description: '',
        chapters: [],
    },
    {
        id: 'bae76c03-6cc5-4ffb-99a0-73b5188aff76',
        title: 'Айтматов последний писатель империи',
        description: '',
        chapters: [],
    },
    {
        id: '180c5f6d-68a8-4469-9b8d-ad5fa84baf53',
        title: 'Алтынкөлдүн аккуусу',
        description: '',
        chapters: [],
    },
]
